[Killed] BlockStatement
creditu-players-assessment-api/src/health/health.controller.ts:6:30
 @Controller('health')
 export class HealthController {
   @Get()
-  public getHealth(): string {
-    return 'API players is up and running';
-  }
+  public getHealth(): string {}
 }
 
killedBy: HealthController should get health
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "API players is up and running"
Received: undefined
