[Survived] Regex
creditu-players-assessment-api/src/players/players.service.ts:19:27
     pageNumber: number,
     documentsPerPage: number,
   ): Promise<GetPlayersBodyOutput> {
-    const isOnlyNumbers = /^[0-9]+$/.test(searchString);
+    const isOnlyNumbers = /[0-9]+$/.test(searchString);
     const $regex = `.*${searchString}.*`;
     const $or: Array<Record<string, any>> = [

[Killed] ObjectLiteral
creditu-players-assessment-api/src/players/players.service.ts:22:19
     const isOnlyNumbers = /^[0-9]+$/.test(searchString);
     const $regex = `.*${searchString}.*`;
     const $or: Array<Record<string, any>> = [
-      { nickname: { $regex } },
+      { nickname: {} },
       { status: { $regex } },
     ];
killedBy: PlayersService should get players using exact id match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,13 +1,11 @@
  Array [
    Object {

[Killed] ConditionalExpression
creditu-players-assessment-api/src/players/players.service.ts:25:9
       { nickname: { $regex } },
       { status: { $regex } },
     ];
-    if (isOnlyNumbers) {
+    if (true) {
       $or.push({ id: parseInt(searchString) });
     }
killedBy: PlayersService should get players without exact match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -10,10 +10,13 @@
          Object {
            "status": Object {

[Killed] ConditionalExpression
creditu-players-assessment-api/src/players/players.service.ts:25:9
       { nickname: { $regex } },
       { status: { $regex } },
     ];
-    if (isOnlyNumbers) {
+    if (false) {
       $or.push({ id: parseInt(searchString) });
     }
killedBy: PlayersService should get players using exact id match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -10,13 +10,10 @@
          Object {
            "status": Object {

[Killed] ConditionalExpression
creditu-players-assessment-api/src/players/players.service.ts:29:9
       $or.push({ id: parseInt(searchString) });
     }
     const pipeline = [];
-    if (searchString !== undefined) {
+    if (true) {
       pipeline.push({ $match: { $or } });
     }
killedBy: PlayersService should get players when searchString is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,23 @@
  Array [
    Object {

[Killed] ConditionalExpression
creditu-players-assessment-api/src/players/players.service.ts:29:9
       $or.push({ id: parseInt(searchString) });
     }
     const pipeline = [];
-    if (searchString !== undefined) {
+    if (false) {
       pipeline.push({ $match: { $or } });
     }
killedBy: PlayersService should get players using exact id match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,26 +1,7 @@
  Array [
    Object {

[Killed] ObjectLiteral
creditu-players-assessment-api/src/players/players.service.ts:30:31
     }
     const pipeline = [];
     if (searchString !== undefined) {
-      pipeline.push({ $match: { $or } });
+      pipeline.push({ $match: {} });
     }
     pipeline.push(
killedBy: PlayersService should get players using exact id match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,24 +1,8 @@
  Array [
    Object {

[Killed] ObjectLiteral
creditu-players-assessment-api/src/players/players.service.ts:30:21
     }
     const pipeline = [];
     if (searchString !== undefined) {
-      pipeline.push({ $match: { $or } });
+      pipeline.push({});
     }
     pipeline.push(
killedBy: PlayersService should get players using exact id match
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,25 +1,7 @@
  Array [
-   Object {

[Killed] ObjectLiteral
creditu-players-assessment-api/src/players/players.service.ts:40:7
           numberOfDocuments: [{ $count: 'numberOfDocuments' }],
         },
       },
-      { $unwind: '$numberOfDocuments' },
+      {},
       {
         $project: {
killedBy: PlayersService should get players when searchString is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -18,13 +18,11 @@
            },
          },

[Killed] ObjectLiteral
creditu-players-assessment-api/src/players/players.service.ts:41:7
         },
       },
       { $unwind: '$numberOfDocuments' },
-      {
-        $project: {
-          players: {
-            $slice: [
-              '$players',
-              (pageNumber - 1) * documentsPerPage,
-              documentsPerPage,
-            ],
-          },
-          pagination: {
-            numberOfDocuments: '$numberOfDocuments.numberOfDocuments',
-            pageNumber: { $literal: pageNumber },
-            documentsPerPage: { $literal: documentsPerPage },
-          },
-        },
-      },
+      {},
     );
     const [result] = await this.playerModel.aggregate(pipeline);
killedBy: PlayersService should get players when searchString is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -21,26 +21,7 @@
      },
    },

[Killed] StringLiteral
creditu-players-assessment-api/src/players/players.service.ts:45:15
         $project: {
           players: {
             $slice: [
-              '$players',
+              "",
               (pageNumber - 1) * documentsPerPage,
               documentsPerPage,
killedBy: PlayersService should get players when searchString is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -34,11 +34,11 @@
            "$literal": 1,
          },

[Killed] ArithmeticOperator
creditu-players-assessment-api/src/players/players.service.ts:46:16
           players: {
             $slice: [
               '$players',
-              (pageNumber - 1) * documentsPerPage,
+              (pageNumber + 1) * documentsPerPage,
               documentsPerPage,
             ],
killedBy: PlayersService should get players when searchString is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -35,11 +35,11 @@
          },
        },

[Survived] ArithmeticOperator
creditu-players-assessment-api/src/players/players.service.ts:46:15
           players: {
             $slice: [
               '$players',
-              (pageNumber - 1) * documentsPerPage,
+              (pageNumber - 1) / documentsPerPage,
               documentsPerPage,
             ],

[Killed] ObjectLiteral
creditu-players-assessment-api/src/players/players.service.ts:53:31
           pagination: {
             numberOfDocuments: '$numberOfDocuments.numberOfDocuments',
             pageNumber: { $literal: pageNumber },
-            documentsPerPage: { $literal: documentsPerPage },
+            documentsPerPage: {},
           },
         },
killedBy: PlayersService should get players when searchString is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -24,13 +24,11 @@
      "$unwind": "$numberOfDocuments",
    },

[Killed] ConditionalExpression
creditu-players-assessment-api/src/players/players.service.ts:59:9
       },
     );
     const [result] = await this.playerModel.aggregate(pipeline);
-    if (!result) {
+    if (false) {
       return {
         players: [],
killedBy: PlayersService should get players using exact id match
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] ConditionalExpression
creditu-players-assessment-api/src/players/players.service.ts:59:9
       },
     );
     const [result] = await this.playerModel.aggregate(pipeline);
-    if (!result) {
+    if (true) {
       return {
         players: [],
killedBy: PlayersService should get players when searchString is undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "players"
Received: {"pagination": {"documentsPerPage": 10, "numberOfDocuments": 0, "pageNumber": 1}, "players": []}
