[Killed] BlockStatement
creditu-players-assessment-api/src/players/players.controller.ts:15:36
   @Get()
   public async getPlayers(
     @Query() query: GetPlayersQueryInput,
-  ): Promise<GetPlayersBodyOutput> {
-    const { searchString, pageNumber, documentsPerPage } = query;
-    return await this.playersService.getPlayers(
-      searchString,
-      pageNumber,
-      documentsPerPage,
-    );
-  }
+  ): Promise<GetPlayersBodyOutput> {}
 }
 
killedBy: PlayersController should get players from query
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "players"
Received: undefined
